Repository: getupcloud/origin-server
Catalog: console/config/locales/*.po
Languages: pt

source: OpenShift may expect certain files to exist in certain directories, which may require you to update your repository after creation.
pt: OpenShift pode esperar que certos arquivos existam em certos diretórios, o que pode requerer que você atualize seu repositório após a criação.

source: We'll create a Git code repository in the cloud, and populate it with a set of reasonable defaults.
pt: Vamos criar um repositório Git na nuvem, e populá-lo com um conjunto de padrões razoável.

source: If you provide a Git URL, your application will start with an exact copy of the code and configuration provided in this Git repository.
pt: Se você fornecer uma URL Git, sua aplicação irá iniciar com uma cópia exata de código e configurações existentes neste repositório Git.

source: Cartridges
pt: Cartuchos

source: Applications are composed of cartridges - each of which exposes a service or capability to your code. All applications must have a web cartridge.
pt: Aplicações são compostas de cartuchos - cada um expõe um serviço ou capacidade para seu código. Toda aplicação deve ter no mínimo um cartucho web.

source: Downloaded cartridges do not receive updates automatically.
pt: Cartuchos baixáveis não recebem atualização automaticamente.

source: Scaling
pt: Escalabilidade

source: OpenShift automatically routes web requests to your web gear.
pt: OpenShift roteia requisições web automaticamente para seu gear.

source: If you allow your application to scale, we'll set up a load balancer and allocate more gears to handle traffic as you need it.
pt: Se você permitir sua aplicação escalar, iremos criar um balanceador de carga e alocar mais gears para atender o tráfego de acordo com a demanda.

source: using
pt: usando

source: of %s
pt: de %s

source: Created
pt: Criado

source: Version
pt: Versão

source: License
pt: Licensa

source: details
pt: detalhes

source: Application name
pt: Nome da aplicação

source: Error, can't create domain
pt: Erro, não pôde criar domínio

source: Because this is your first application, you need to provide a domain under which your applications will be grouped
pt: Por ser sua primeira aplicação, você deve fornecer um domínio sob o qual suas aplicações serão agrupadas

source: You can also %s.
pt: Você também pode %s

source: Delete Application
pt: Deletar Aplicação

source: This will delete all the code and data associated with the app, and cannot be undone.
pt: Isso irá deletar todo o código e dados associados com a aplicação, e não pode ser desfeito.

source: Make sure this is something you really want to do!
pt: Certifique-se que é isso mesmo que você quer fazer!

source: Welcome to OpenShift
pt: Bem-vindo ao OpenShift

source: OpenShift helps you build and deploy web applications, mobile backends, service oriented architectures, and host your favorite services.
pt: OpenShift ajuda você a criar e publicar aplicações web, backends de mobile, arquiteturas orientadas a serviços, e hospedar suas aplicações favoritas.

source: Choose a web framework or codebase to start from
pt: Escolha um framework web ou aplicação para iniciar

source: Try JBoss, PHP, Python, Ruby, Node.js, or create a new Drupal or Wordpress site instantly.
pt: Experimente JBoss, PHP, Python, Ruby, Node.js ou crie um novo site Drupal ou Wordpress instantaneamente.

source: Add cartridges like MySQL or MongoDB to your application
pt: Adicione cartuchos como MySQL ou MongoDB em sua aplicação

source: OpenShift lets you add services and tools to your application through <strong>cartridges</strong> - including databases, cache servers, management tools, and continuous integration servers.
pt: OpenShift permite que você adicione serviços e ferramentas em sua aplicaçao através de <strong>cartuchos</strong> - incluindo bases de dados, serviços de cache, ferramentas de gerenciamento e servidores de integração contínua.

source: Upload your code to OpenShift via Git
pt: Envie seu código para o OpenShift via Git

source: Your source code is stored with your application in a Git version control repository.
pt: Seu código fonte é armazenado junto a sua aplicação em um repositório de controle de versão Git.

source: Get Started
pt: Primeiros Passos

source: Your application has been created. %s.
pt: Sua aplicação foi criada. %s

source: Looking for tips on what to build or where to go next? We've organized some helpful hints for you.
pt: Procurando por dicas sobre o que fazer ou onde ir depois? Nós organizamos algumas idéias para você.

source: Making code changes
pt: Fazendo mudanças no código

source: You must %s before you can access application source code.
pt: Você deve primeiro %s antes de acessar o código fonte da aplicação.

source: %s for your operating system, and from your command line run
pt: %s para seu Sistema Operacional, e execute a partir da linha de comando

source: Install the Git client
pt: Instale o cliente Git

source: This will create a folder with the source code of your application. After making a change,
pt: Isto irá criar uma pasta com o código fonte de sua aplicação. Após fazer uma alteração,

source: add,
pt: e

source: and
pt: e

source: your changes.
pt: suas mudanças.

source: When you push changes the OpenShift server will report back its status on deploying your code.
pt: Enquanto você envia mudanças, o servidor do OpenShift irá reportar o status de deploy do seu código.

source: Manage your app
pt: Gerencie seu app

source: The console is convenient, but if you need deeper control try our other client tools
pt: O console é conveniente, mas se você precisa de maior controle experimente outra ferramenta cliente

source: Command-Line
pt: Linha de Comando

source: All of the capabilities of OpenShift are exposed through our command line tool,
pt: Todo o poder do OpenShift é exposto através de nossa ferramenta de linha de comando,

source: The JBoss Developer Studio is a full featured IDE with OpenShift integration built in.
pt: O JBoss Developer Studio é uma IDE completa com integração OpenShift built in.

source: It gives you the ability to create, edit and deploy applications without having to leave the IDE.
pt: Ele permite criar, editar e publicar aplicações sem ter que deixar a IDE.

source: Applications
pt: Aplicações

source: Available in domain
pt: Disponível no domínio

source: shared by %s
pt: compartilhado por %s

source: Add
pt: Adicionar

source: Application&hellip;
pt: Aplicação&hellip;

source: You may want to...
pt: Talvez você queria...

source: Set your first key
pt: Defina sua primeira chave

source: Access source code or SSH to your gears
pt: Acessar código fonte ou SSH em seus gears

source: Use an empty domain
pt: Usar um domínio vazio

source: %s another domain
pt: %s outro domínio

source: Collaborate on someone else's domain
pt: Colaborar no domínio de alguém

source: Add a Database
pt: Adicione uma base de dados

source: Add a database to an app
pt: Adicionar uma base de dados em uma aplicação

source: Add a collaborator
pt: Adicionar um colaborador

source: Customize your URL
pt: Customize sua URL

source: Use your own domain name
pt: Usar seu próprio domínio

source: Scale with traffic
pt: Escale com o tráfego

source: Create a scalable application
pt: Criar uma aplicação escalável

source: From the command line
pt: A partir da linha de comando

source: The <code>rhc</code> client lets you:
pt: O cliente <code>rhc</code> permite que você:

source: Watching logs
pt: Inspecionando logs

source: Access logs
pt: Acesse logs

source: Backup and Restore
pt: Backup e Restore

source: Save and restore backups
pt: Salve e restaure backups

source: Forwarding ports
pt: Redirecionamento de portas

source: Connect directly to internal services
pt: Conecte diretamente a serviços internos

source: %s started /
pt: %i inciado /

source: Scales
pt: Escalabilidade

source: Status
pt: Estado

source: Environment Variables
pt: Variáveis de Ambiente

source: Databases
pt: Bases de Dados

source: Continuous Integration
pt: Integração Contínua

source: Tools and Support
pt: Ferramentas e Suporte

source: Pass this URL to 'git clone' to copy the repository locally.
pt: Passe esta URL ao 'git clone' para copiar o repositório localmente.

source: Remote Access
pt: Acesso Remoto

source: Members from domain
pt: Membros do domínio

source: Next Steps
pt: Próximos Passos

source: Will you be changing the code of this application?
pt: Você pretende alterar o código desta aplicação?

source: Yes, help me get started
pt: Sim, ajude-me a iniciar

source: Or %s
pt: Ou %s

source: How to use your token
pt: Como usar seu token

source: To make a request to the OpenShift REST API, pass the token as an Authorization header
pt: Para fazer uma requisição na API REST do OpenShift, passe o token como um cabeçalho 'Authorization'

source: For example, from the command line program cURL use the <code>-H</code> option
pt: Por exemplo, com o programa de linha de comando cURL, use a opção <code>-H</code>

source: You can pass this token directly to the <code>rhc</code> command with the <code>--token</code> option:
pt: Você pode passar este token diretamente ao comando <code>rhc</code> com a opção <code>--token</code>:

source: Edit Authorization Token
pt: Editar Token de Autorização

source: The token will allow clients to perform these operations on your behalf:
pt: O token vai permitir que clientes realizem estas operações em seu nome:

source: Scope
pt: Escopo

source: Description
pt: Descrição

source: Add Authorization
pt: Adicionar Autorização

source: Select which rights you want to allow clients to have. You may select multiple scopes, or if you select none the server will choose a default scope. Note: If you select several scopes, you'll be able to perform actions that any of your scopes allow, but your token will expire after the shortest scope expires.
pt: Selecione quais direitos você quer que os clientes possuam. Você pode selecionar múltiplos escopos, ou se não selecionar nenhum o servidor vai escolher um escopo padrão. Nota: Caso selecione múltiplos escopos, será possível executar ações de todos eles, mas o token irá expirar de acordo com o escopo mais curto.

source: (default)
pt: (padrão)

source: Or, you can enter scopes directly for those that require a parameter. Separate multiple scopes with a space or comma.
pt: Ou, você pode inserir escopos diretamente para aqueles que requerem um parâmetro. Separe múltiplos escopos com um espaço ou vírgula

source: Authorization Token
pt: Token de Autorização

source: Disable Jenkins Builds
pt: Desabilitar Builds Jenkins

source: If you remove the Jenkins cartridge your build history and results are preserved, but new changes to Git will no longer start builds.
pt: Se você remover o cartuchos Jenkins seu histórico de builds e os resultados serão preservados, mas novas mudança no Git não irão mais iniciar builds.

source: Are you sure you wish to disable builds for this application?
pt: Tem certeza que você deseja desabilitar builds para esta aplicação?

source: Enable Jenkins Builds for %s
pt: Habilitar Builds Jenkins para %s

source: To build with Jenkins, OpenShift needs a server (created as a separate application) and a Jenkins client cartridge attached to each buildable application.
pt: Para fazer build com Jenkins, OpenShift necessita de um servidor (criado como uma aplicação separada) e um cliente Jenkins incluído em cada aplicação alvo.

source: Build jobs execute on the gear that contains the client cartridge, while the Jenkins server schedules jobs and stores history and other build results.
pt: Builds de jobs executam no gear que contém o cartucho cliente, enquanto o servidor Jenkins agenda jobs e armazena o histórico e outros resultados dos builds.

source: Build server available
pt: Servidor de build disponível

source: You can log in to Jenkins at:
pt: Você pode entrar no Jenkins em:

source: Create server
pt: Criar servidor

source: You must create a Jenkins server to store build history. You can customize the name of the application within your domain:
pt: Você deve criar um servidor Jenkins para guardar o histórico de builds. Se desejar, customize o nome da aplicação em seu domínio:

source: Create cartridge
pt: Criar cartucho

source: The Jenkins client cartridge listens for changes to your Git source code repository and triggers new builds.
pt: O cartucho cliente Jenkins espera por mudanças no seu repositório Git de código fonte e dispara um novo build.

source: If you remove the cartridge later, your build history will remain but the job will be disabled.
pt: Se você remover o cartucho, o histórico de builds irá permanecer, mas o jobs desaparece.

source: Enabling the Jenkins server and configuring your build job may take a few minutes to complete while we wait for your new application to become available through DNS.
pt: Habilitar o servidor Jenkins ou configurar seu job de build pode demorar alguns minutos até que sua nova aplicação esteja visível no DNS.

source: Do you want to enable Jenkins for your application?
pt: Você quer habilitar Jenkins para suas aplicações?

source: Building your Application
pt: Construindo sua Aplicação

source: OpenShift is configured to build this application with %s when you make changes through Git. You can track the progress of builds through the following Jenkins job:
pt: OpenShift está configurado para fazer o build desta aplicação com %s quando você fizer mudanças através do Git. Rastreie o progresso dos builds através do seguinte job no Jenkins:

source: If you no longer wish to run Jenkins builds, you can %s.
pt: Se não quiser mais rodar builds no Jenkins, você pode %s.

source: Downloaded cartridges do not receive updates automatically
pt: Cartuchos baixáveis não recebem atualizações automáticas

source: What you get:
pt: O que você recebe:

source: Requires %s
pt: Requer %s

source: Conflicts with %s
pt: Conflita com %s

source: Cannot be added to %s
pt: Não pode ser adicionado ao %s

source: Add a Cartridge
pt: Adicionar um Cartucho

source: There are no cartridges that can be installed
pt: Não existem cartuchos que possam ser instalados

source: Choose a cartridge to add to your application.
pt: Escolha um cartucho para adicionar em sua aplicação.

source: Install your own cartridge
pt: Instale seu próprio cartucho

source: You may also add your own cartridges by providing a link to a %s. OpenShift will download and install the cart into your application. Remember that downloaded cartridges will not automatically receive updates.
pt: Você também pode adicionar seu próprio cartucho fornecendo o link para um %s. OpenShift vai baixar e instalar o cartucho em sua aplicação. Lembre-se que cartuchos baixáveis não recebem atualização automática.

source: Download a cartridge into this app
pt: Baixar um cartucho nesta aplicação

source: Installed
pt: Instalados

source: Has Dependencies
pt: Possui Dependências

source: Add Cartridge to %s
pt: Adicionar Cartucho em %s

source: This cartridge will be downloaded into your application.
pt: Este cartucho será baixado em sua aplicação.

source: The cart will have access to all of your application data - be sure this is what you really want to do!
pt: O cartucho terá acesso a todos os dados de sua aplicação - certifique-se que é isso mesmo que você deseja fazer!

source: Using Gear Size
pt: Usando Tamanho de Gear

source: Do you want to add the
pt: Você quer incluir o cartucho

source: cartridge to your application?
pt: em sua aplicação?

source: Your cartridge has been added. %s.
pt: Seu cartucho foi incluído. %s.

source: Managing your cartridge
pt: Gerenciando seu cartucho

source: Most of the capabilities of OpenShift are exposed through our command line tool, <code>rhc</code>.
pt: Todo o poder do OpenShift é exposto através de nossa ferramenta de linha de comando,

source: Whether it's adding cartridges, checking uptime, or pulling log files from the server, you can quickly put a finger on the pulse of your application.
pt: Tanto ao adicionar cartuchos, verificar uptime ou analizar arquivos de log do servidor em tempo real, você pode rapidamente dar uma olhadinha no que está acontecendo com sua aplicação.

source: You can get a list of cartridges by running
pt: Você consegue uma lista de cartuchos ao executar

source: You can manage the cartridge by running one of these commands
pt: Você pode gerenciar o cartucho executando um desses comandos

source: You can remove the cartridge by running the following command.
pt: Você pode remover o cartucho executando o seguinte comando.

source: Warning: make sure you've backed up any data you wish to keep before running this command
pt: Aviso: Certifique-se de que você fez backup de quaisquer dados que deseja manter antes de executar este comando

source: Cartridge info
pt: Informação de cartucho

source: Accessing your application
pt: Acessando sua aplicação

source: You can try <a href="javascript:window.location.reload();">refreshing the page</a>, if the problem is temporary.
pt: Você pode tentar <a href="javascript:window.location.reload();">atualizar a página</a>, se o problema for temporário.

source: You can also try the following:
pt: Você também pode tentar o seguinte:

source: Seek assistance in one of our %s.
pt: Busque ajuda em um de nossos %s.

source: Join %s on Freenode.
pt: Junte-se %s na Freenode.

source: If you are experiencing a repeatable error not related to a service outage, %s.
pt: Se estiver passando por um error repetidamente, não relacionado a queda de serviço, %s.

source: Reference \#%s
pt: Referência \#%s.

source: Help
pt: Ajuda

source: Create
pt: Criar

source: Just starting with OpenShift?
pt: Recém iniciando com OpenShift?

source: Get your first application up off the ground through the application creation wizard.
pt: Decole sua primeira aplicação a partir do wizard de criação.

source: Create an app now
pt: Crie uma aplicação agora

source: If you prefer the command line, %s will help you install the client tools, create your application, and make your first change.
pt: Se você prefere a linha de comando, %s irá ajudá-lo a instalar nossa ferramenta cliente, criar sua aplicação e fazer sua primeira publicação.

source: Our %s has tutorials for creating apps based many different technologies like %s, %s, and %s. If you don't see your favorite framework, %s.
pt: Nossa %s possui tutoriais para criar aplicações baseadas em diversas tecnologias diferentes como %s, %s e %s. Se você não encontra seu framwork favorito, %s.

source: Get Started Fast page
pt: página Get Started Fast

source: let us know
pt: avise-nos

source: Engage
pt: Envolva-se

source: Need to know what's new?
pt: Quer saber o que vem a seguir?

source: The OpenShift newsletter is a great way to track the latest news.
pt: A newsletter OpenShift é um ótimo jeito de conhecer as últimas novidades.

source: Subscribe today
pt: Assine hoje

source: OpenShift is %s and can be %s. %s and help drive our evolution.
pt: OpenShift é %s e pode ser %s. %s e ajude a direcionar nossa evolução.

source: Follow us on Twitter at %s or read the %s.
pt: Siga-nos no Twitter em %s ou leia o %s.

source: Learn
pt: Aprender

source: Want to explore our platform?
pt: Quer explorar nossa plataforma?

source: %s is the first destination for new developers to find the information you need about OpenShift.
pt: %s é o primeiro destino para novos desenvolvedores encontrarem informações sobre OpenShift.

source: When you're looking for a great reference for understanding OpenShift, look no further than the %s. It covers the entire experience and can be downloaded as HTML or PDF when you're on the go.
pt: Se estiver procurando por uma ótima referência para entender o OpenShift, não procure além do %s. Ele cobre a experiência completa e pode ser baixado como HTML ou PDF.

source: Our technology highlight pages bring together what you need to know - %s and %s are up now, with more to come.
pt: Nossa página de tecnologias agrupa tudo aquilo que você precisa saber - %s e %s estão em alta no momento, com mais para chegar.

source: For some great technology dives %s.
pt: Para mergulhar profundamente na tecnologia, %s.

source: Troubleshoot
pt: Solucionando Problemas

source: Hit a bump in the road?
pt: Ficou trancado no meio do caminho?

source: Our %s is watched round the clock by an army of developers, evangelists, and OpenShift devotees.
pt: Nosso %s é vigiado constantemente por um exército de desenvolvedores e evangelistas OpenShift devotos.

source: Check out the %s for known headaches and %s for more general questions
pt: Confira nossa %s para dores de cabeça conhecidas e a %s para questões mais gerais

source: Talk directly to the team on IRC - %s.
pt: Fale diretamente com a equipe no IRC - %s.

source: If you've found a real humdinger of a problem with the console, site, or community - %s and we'll try to make it right.
pt: Se você encontrou um problema com o console, site ou comunidade - %s e vamos tentar consertar.

source: The page you requested was not found or may no longer exist
pt: A página que você solicitou não foi encontrada ou talvez não exista mais

source: Were you looking for any of the following?
pt: Está procurando por algum destes?

source: %s if you feel you have reached this page in error.
pt: %s se você acredita que chegou a esta página por um erro.

source: The OpenShift service is temporarily unavailable while we perform server maintenance.
pt: OpenShift está temporariamente indisponível enquanto realizamos a manutenção do servidor.

source: Unauthorized
pt: Não autorizado

source: The console was unable to authenticate you with the OpenShift server.
pt: O console não conseguiu autenticar você com o servidor OpenShift.

source: You may need to verify that your system configuration is accurate.
pt: Talvez você precise verificar se a configuração do sistema está correta.

source: http://applicationname&ndash;
pt: http://aplicação&ndash;

source: Domain name
pt: Nome do Domínio

source: Your domain name must be letters or numbers with no spaces or symbols.
pt: Seu nome de domínio deve conter apenas letras ou números, sem espaços ou símbolos.

source: Delete Domain
pt: Deletar Domínio

source: Are you sure you want to delete the domain
pt: Você tem certeza que deseja remover o domínio

source: This cannot be undone. Make sure this is something you really want to do!
pt: Esta operação não pode ser desfeita. Certifique-se que é isso mesmo que você quer fazer!

source: Change your Namespace
pt: Mude seu Namespace

source: Warning - Changing your domain name will alter the public URLs of your applications.
pt: Cuidado - Mudar seu domínio irá alterar as URLs públicas de suas aplicações.

source: If you change your domain name you will need to update any bookmarks or external links to your applications.
pt: Se você mudar o nome de seu domínio, será necessário atualizar bookmarks ou links externas para suas aplicações.

source: Your domains
pt: Seus domínios

source: Domains shared with you
pt: Domínios compartilhados com você

source: Domain&hellip;
pt: Domínio&hellip;

source: Create a Domain
pt: Criar um Domínio

source: Domains group applications for collaboration and logical organization.
pt: Domínios agrupam aplicações para colaboração e organização lógica.

source: Each domain name must be unique, and is the suffix of the public URLs we assign to your applications.
pt: Cada nome de domínio deve ser único, usado como sufixo das URLs pública que atribuímos a suas aplicações.

source: Allows %s gears
pt: Permite gears %s

source: The owner has disabled creation - no gear sizes allowed
pt: O dono desabilitou a criação - nenhum gear é permitido

source: Members
pt: Membros
