Repository: getupcloud/origin-server
Catalog: console/config/locales/*.po
Languages: pt

source: Provide your technical and billing contact information.
pt: Forneça seus dados de contato técnico e de cobrança

source: Technical Info
pt: Contato Técnico

source: Billing Info
pt: Contato de Cobrança

source: Invoices
pt: Faturas

source: Access your monthly invoice.
pt: Acesse suas faturas mensais.

source: Credit
pt: Crédito

source: Below are you current credit, used on your next invoice.
pt: Abaixo estão seus créditos, usados em sua próxima fatura.

source: Credit:
pt: Crédito:

source: Bonus:
pt: Bônus:

source: Undestand
pt: Entenda

source: Your trial period has finished.
pt: Seu período de testes termniou.

source: Please validate your account below in order to have access to more resources.
pt: Por favor, valide sua conta abaixo para ter acesso a mais recursos.

source: You have %s of %s total.
pt: Você possui %s de %s total.

source: gear available
pt: gear disponível

source: gears available
pt: gears disponíveis

source: Payment
pt: Pagamento

source: Current Payment Method:
pt: Método de Pagamento Atual:

source: Paypal Account:
pt: Conta Paypal:

source: Date:
pt: Data:

source: Amount:
pt: Valor:

source: Key:
pt: Chave:

source: Brand:
pt: Bandeira:

source: Last Digits:
pt: Últimos Digitos:

source: Holder Name:
pt: Nome no Cartão:

source: Choose Payment Method
pt: Escolha o Método de Pagamento

source: Credit Card
pt: Cartão de Crédito

source: Fill in your Credit Card Information
pt: Preencha seus dados de Cartão de Crédito

source: Your browser doesn't seams to support JavaScript
pt: Aparentemtne seu navegador não suporta JavaScript

source: Number
pt: Número

source: Expiration Month
pt: Mês de Expiração

source: Expiration Year
pt: Ano de Expiração

source: Holder Name
pt: Nome no Cartão

source: Validation Code
pt: Código de Validação

source: Validate
pt: Validar

source: Primary Contact
pt: Contato Técnico

source: Billing Contact
pt: Contato de Cobrança

source: We use this information to contact you regarding any billing issue regarding your account.
pt: Utilizamos estas informações para entra em contato com você caso exista alguma questão com o pagamento em sua conta.

source: We use this information to contact you regarding any technical issue we may found in your apps.
pt: Utilizamos estas informações para entra em contato com você caso exista alguma questão técnica com suas aplicações.

source: Use Primary Contact
pt: Usar Contato Técnico

source: Phone
pt: Telefone

source: Address
pt: Endereço

source: City
pt: Cidade

source: State
pt: Estado

source: Country
pt: País

source: ZIP Code
pt: Código Postal

source: Invoice History
pt: Histórico de Faturas

source: Reference Month
pt: Mês de Referência

source: Processing Date
pt: Data de Processamento

source: Amount
pt: Valor

source: new
pt: novo

source: sent
pt: enviado

source: paid
pt: pago

source: failed
pt: falhou

source: canceled
pt: cancelado

source: Period: %s - %s
pt: Período: %s - %s

source: Invoice:
pt: Fatura:

source: Client:
pt: Cliente:

source: Reference:
pt: Referência

source: Start - End
pt: Início - Fim

source: Quantity
pt: Quantidade

source: Unit
pt: Unidade

source: Unit Cost
pt: Custo Unitário

source: Total Cost
pt: Custo Total

source: hour
pt: hora

source: Credits
pt: Créditos

source: Discount
pt: Desconto

source: Free hour/gear (recurring credit)
pt: Hora/gear grátis (crédito recorrente)

source: Free hour/gear (single shot bonus)
pt: Hora/gear grátis (bonus , uso não acumulativo)

source: Free hour/gear (voucher)
pt: Hora/gear grátis (voucher)

source: Final Total
pt: Total Final

source: Your session expired.
pt: Sua sessão expirou.

source: An error occurred
pt: Ocorreu um Erro

source: Page not found
pt: Página não encontrada

source: Maintenance in progress
pt: Manutenção em progresso

source: Disable Scaling
pt: Desabilitar Escalabilidade

source: Scale your Application
pt: Escale sua Aplicação

source: Change Gear Storage
pt: Mudar Storage do Gear

source: Are you sure you want to delete the application <strong>'%s'</strong> from domain <strong>'%s'</strong>?
pt: Você tem certeza que deseja deletar a aplicação <strong>'%s'</strong> do domain <strong>'%s'</strong>?

source: Click here
pt: Clique aqui

source: to validate your account in order to receive your credit.
pt: para validar sua conta e receber seu crédito.

source: There are no available gears.
pt: Não existem gears disponíveis.

source: Please, validate your account.
pt: Por favor, valide sua conta.

source: Gear Prices
pt: Preços de Gears

source: [+] More
pt: [+] Mais

source: Add Cartridge
pt: Adicionar Cartucho

source: See all application types
pt: Veja todos os tipos de cartuchos

source: Cartridge&hellip;
pt: Cartucho&hellip;

source: Next
pt: Próximo

source: day
pt: dia

source: month
pt: mês

source: year
pt: ano

source: Account updated with success.
pt: Conta atualizada com sucesso

source: Old password can't be blank.
pt: Senha antiga não pode ser vazia.

source: New password can't be blank.
pt: Senha nova não pode ser vazia.

source: Password doesn't match confirmation.
pt: Senha não bate com a confirmação.

source: Invalid password.
pt: Senha inválida.

source: Error while changing your password.
pt: Ocorreu um erro ao alterar sua senha.

source: Your password has been changed.
pt: Sua senha foi atualizada.

source: Your account is validated. Thank you!
pt: Sua conta foi validada. Obrigado!

source: Subscription canceled
pt: Assinatura cancelada

source: Please, review your credit card information and try again.
pt: Por favor, revise os dados de seu cartão de crédito e tente novamente.

source: Select language
pt: Selecione o idioma

source: Change Payment Method
pt: Mudar o Método de Pagamento

source: IRC Channel #getupcloud
pt: Canal IRC #getupcloud

source: set up a CNAME record with your DNS provider
pt: configurar um registro CNAME em seu provedor DNS

source: English
pt: Inglês

source: Portuguese (Brazil)
pt: Português (Brasil)

source: Reset Your Password
pt: Redefina sua Senha

source: Password reset sent.
pt: Redefinição de senha enviada

source: Unable to reset your password: %s
pt: Erro ao redefinir sua senha: %s

source: Please contact support@getupcloud.com
pt: Por favor contate suporte@getupcloud.com

source: Password too short (min 6 characteres)
pt: Senha muito curta (mínino 6 caracteres)

source: Bad Token
pt: Token inválido

source: Your password is now changed.
pt: Sua senha foi alterada.

source: Not now, continue
pt: Agora não, continue

source: visit app in the browser
pt: visite a aplicação no navegador

source: Requires a %s.
pt: Requer uma

source: public key
pt: chave pública

source: You must %s before you can upload code or remotely access your application.
pt: Primeiro você deve %s antes de publicar código remotamente ou acessar o servidor da aplicação.

source: add an SSH public key to your account
pt: enviar uma chave pública para sua conta

source: For pricing and more information about storage for your application see %s.
pt: Para mais informações sobre storage para sua aplicação, %s.

source: our pricing page
pt: veja nossa página de preços

source: For pricing consult %s.
pt: Para preços %s.

source: Set an SSH key
pt: Incluir uma chave ssh

source: %s to
pt: %s para

source: <p>OpenShift uses the Secure Shell protocol to protect direct access to your application. In order to upload or download source code from Git or to remotely access the gears in your app, you'll need to create and upload a public SSH key.</p>
pt: <p>OpenShift usa o protocolo Secure Shell para protejer o acesso direto a sua aplicação. Para publicar ou baixar o código fonte do Git ou acessar remotamente os gears em sua aplicação, você precisa criar e adicionar um chave pública SSH.</p>

source: OpenShift uses the %s for your source code, and grants you access to it via the Secure Shell (SSH) protocol.
pt: OpenShift usa o protocolo Secure Shell para protejer o acesso direto a sua aplicação.

source: In order to upload and download code to your application you need to give us your %s.
pt: Para publicar ou baixar o código fonte do Git ou acessar remotamente os gears em sua aplicação, você precisa criar e adicionar um chave pública SSH.

source: Git version control system
pt: sistema de controle de vesão GIT

source: public SSH key
pt: chave pública SSH

source: Note: You can also %s and run <code>rhc setup</code> to generate and upload your key automatically.
pt: Nota: Você também pode %s e executar <code>rhc setup</code> para gerar e subir sua chave ssh automaticamente.

source: install the RHC command line tool
pt: instalar a ferramenta de linha de comando RHC

source: Add alias
pt: Incluir alias

source: If this is your first time creating a public key %s.
pt: Se esta é sua primeira vez criando uma chave pública, %s.

source: read more about SSH keys and remote access
pt: leia mais sobre chaves SSH e acesso remoto.

source: YouTube Channel
pt: Canal YouTube

source: Sign Out
pt: Sair

source: Can't find what you're looking for? %s on our community, or %s
pt: Não encontra o que procura? %s em nossa comunidade, ou %s

source: create your own!
pt: crie você mesmo!

source: Browse the Quickstarts
pt: Navegue pelos Quickstarts

source: Change Credit Card
pt: Trocar o Cartão de Crédito

source: Validate your account
pt: Valide sua conta

source: Create your first application now
pt: Crie sua primeira aplicação agora

source: For more about OpenShift, see the %s
pt: Para mais informações sobre OpenShift, veja a %s

source: How it Works page
pt: página Como Funciona

source: Can't find the gear you're looking for? Check if it's %s
pt: Não encontra o gear que procura? Certifique-se que esteja %s

source: enabled for this namespace.
pt: habilitado para este namespace.
