Repository: getupcloud/origin-server
Catalog: console/config/locales/*.po
Languages: pt

source: Alias '%s' has been created
pt: Alias '%s' foi criado

source: Alias '%s' has been removed
pt: Alias '%s' foi removido

source: Alias '%s' has been updated
pt: Alias '%s' foi atualizado

source: All web cartridges
pt: Todos os cartuchos web

source: All instant applications
pt: Todos os instant apps

source: Tagged with %s
pt: Tageado com %s

source: Matches search '%s'
pt: Encontrado para '%s'

source: Other types
pt: Outros tipos

source: No cartridges are defined for this type - all applications require at least one web cartridge
pt: Nenhum cartucho definido para este tipo - toda aplicação necessita de pelo menos um cartucho web

source: The cartridges defined for this type are not valid. The %s may not be correct.
pt: Os cartuchos definidos para este tipo não são válidos. A URL %s pode estar incorreta.

source: All
pt: Todos

source: The application '%s' has been deleted
pt: A aplicação '%s' foi deletada

source: You cannot create applications in the '%s' namespace
pt: Você não pode criar aplicações no namespace '%s'

source: Unable to create domain, %s
pt: Impossível cria domínio, %s

source: Application creation is taking longer than expected. Please wait a few minutes, then refresh this page.
pt: A criação da aplicação está demorando mais do que o esperado. Por favor espere alguns minutos antes de recarreguar esta página.

source: The thread %s (index=%s) did not complete within %s seconds.
pt: A thread %s (index=%s) não completou em %s segundos.

source: New authorization token created
pt: Novo token de autorização criado

source: Authorization updated
pt: Autorização atualizada

source: The authorization has been revoked
pt: A autorização foi revogada

source: All authorizations revoked
pt: Todas as autorizações foram revogadas

source: Your application is now building with Jenkins.
pt: Sua aplicação agora está sendo construida com Jenkins.

source: The Jenkins server is not yet registered with DNS. Please wait a few minutes before trying again.
pt: O servidor Jenkins ainda não está visível no DNS. Por favor, espere alguns minutos antes de tentar novamente.

source: %s is no longer building through Jenkins.
pt: %s não está mais sendo construida com Jenkins.

source: Authenticate to %s
pt: Autenticado em %s

source: Application %s
pt: Aplicação %s

source: Create a new application
pt: Criar uma nova aplicação

source: See other application types
pt: Veja outros tipos de aplicações

source: The domain '%s' has been created
pt: O domínio '%s' foi criado

source: The domain '%s' has been updated.
pt: O domínio '%s' foi atualizado.

source: All applications must be removed from this domain before it can be deleted
pt: Todas as aplicações devem ser removidas deste domínio antes de deletá-lo

source: The domain '%s' has been deleted
pt: O domínio '%s' foi deletado

source: Your public key has been created
pt: Sua chave pública foi criada

source: You have already created a key with that name
pt: Você já possui uma chave com este nome

source: Updated members
pt: Membros atualizados

source: Could not update members.
pt: Impossível atualizar membros

source: You are no longer a member of '%s'
pt: Você não é mais um membro de '%s'

source: Could not leave '%s'
pt: Impossível deixar '%s'

source: An unexpected OAuth response (non-302, non-error) was received
pt: Uma resposta inesperada OAuth (não-302, não-erro) foi recebida

source: OAuth Error: Unexpected response
pt: Erro OAuth: Resposta inesperada

source: OAuth Error: %s
pt: Erro OAuth: %s

source: The application '%s' has been restarted
pt: A aplicação '%s' foi reiniciada

source: Updated scale settings for cartridge '%s'
pt: Configurações de escalabilidade atualizadas para o cartucho '%s'

source: You need to set a namespace before you can create applications
pt: Você deve definir um namespace antes de criar aplicações

source: You need to set a public key before you can work with application code
pt: Você deve definir uma chave pública antes de acessar o código da aplicação

source: Updated storage for cartridge '%s'
pt: Storage atualizado para o cartucho '%s'

source: The team '%s' has been created
pt: O time '%s' foi criado

source: The team '%s' has been deleted
pt: O time '%s' foi deletado

source: the domain owner's
pt: conta do dono do domínio

source: your
pt: sua conta

source: This will add %s to %s account and will result in additional charges.
pt: Isto irá adicionar %s na %s e resultará em custos adicionais.

source: This will add at least %s to %s account and may result in additional charges.
pt: Isto irá adicionar %s na %s e pode resultar em custos adicionais.

source: No gears will be added to %s account.
pt: Nenhum gear será adicionado na %s

source: This will add an unknown number of gears to %s account.
pt: Isto irá adicionar um número desconhecido de gears na %s

source: This will add between %s and %s gears to %s account.
pt: Isto irá adicionar entre %s e %s gears na %s

source: This will add %s to %s account.
pt: Isto irá adicionar %s na %s

source: %s Additional charges may be accrued for premium cartridges.
pt: %s Custos adicionais podem ser incluídos para cartuchos premium.

source: %s The selected gear type will have additional hourly charges.
pt: %s O tipo de gear selecionado terá custo por hora adicional.

source: May include additional usage fees at certain levels, see plan for details.
pt: Pode incluir taxas adicionais de use em certos níveis. Veja seu plano para mais detalhes.

source: Developer Center
pt: Central do Desenvolvedor

source: OpenShift User Guide
pt: Guia de Usuário OpenShift

source: Installing OpenShift client tools on Mac OSX, Linux, and Windows
pt: Instalando OpenShift client tools no Mac OSX, Linux e Windows

source: Sync your OpenShift repo with an existing Git repo
pt: Sincronize seu repo Git OpenShift com um repo Git existente

source: How do I start a new Forum discussion?
pt: Como inicio uma nova discussão no Forum?

source: How do I install the rhc client tools on Windows?
pt: Como instalo o rhc client tools no Windows?

source: Choose a type of application
pt: Escolha um tipo de aplicação

source: Configure the application
pt: Configure a aplicação

source: Next steps
pt: Próximos passos

source: Choose a cartridge type
pt: Escolha um tipo de cartucho

source: Configure the cartridge
pt: Configure o cartucho

source: My Applications
pt: Minha Aplicações

source: Domains
pt: Domínios

source: Create an application
pt: Criar uma aplicação

source: My Account
pt: Minha Conta

source: Settings
pt: Configurações

source: Mr.
pt: Sr.

source: Miss
pt: Srta.

source: Mrs.
pt: Srta.

source: Ms.
pt: Sra.

source: Cartridge
pt: Cartucho

source: Or, see the entire list of cartridges you can add
pt: Ou, veja a lista completa de cartuchos que você pode adicionar

source: Show other cartridges you can add to this application
pt: Mostrar outros cartuchos que você pode adicionar na aplicação.

source: Remove or change your Jenkins configuration
pt: Remover ou alterar as configurações de seu Jenkins

source: The owners of the available domains have disabled all gear sizes from being created.
pt: Os donos dos domínios disponíveis desabilitaram a criação de todos os tipos de gears.

source: You have disabled all gear sizes from being created.
pt: Você desabilitou a criação de todos os tipos de gears.

source: There are not enough free gears available to create a new application. You will either need to scale down or delete existing applications to free up resources.
pt: Não existem gears livres disponíveis para criar uma nova aplicação. Você precisa desescalar ou deletar aplicações existentes para liberar recursos.

source: Your web cartridge is running on the minimum amount of gears and will scale up if needed
pt: Seu cartucho web está rodando com a quantidade mínima de gears e irá escalar se necessário

source: Your web cartridge is running on the maximum amount of gears and cannot scale up any further
pt: Seu cartucho web está rodando com a quantidade máxima de gears e não pode escalar mais

source: Your web cartridge is running multiple copies to handle increased web traffic
pt: Seu cartucho web está rodando em múltiplas copias para atender o incremento do tráfego web

source: Routing to %s%s
pt: Roteando para %s%s

source: web gear
pt: gear web

source: no gears
pt: nenhum gear

source: None
pt: Nada

source: OpenShift runs each cartridge inside one or more gears on a server and is allocated a fixed portion of CPU time and memory use.
pt: OpenShift roda cada cartucho dentro de um ou mais gears em um servidor, alocando uma porção fixa de tempo de CPU e memória.

source: %s at maximum scale in this application. Currently using %s.
pt: %s na escala máxima nesta aplicação. Atualmente usando %s.

source: cartridge
pt: cartucho

source: %s at minimum scale in this application. Currently using %s.
pt: %s na escala mínima nesta aplicação. Atualmente usando %s.

source: %s above minimum scale in this application. Currently using %s.
pt: %s acima da escala mínima nesta aplicação. Atualmente usando %s.

source: This application is running at a fixed scale ratio, and is using %s.
pt: Esta aplicação está rodando em uma escala fixa, e está usando %s.

source: Unscaled application using %s
pt: Aplicação não-escalável usando %s

source: All available
pt: Tudo disponível

source: Use -1 to scale to your current account limits
pt: Use -1 para escalar até os limites de sua conta

source: No scaling
pt: Sem escalabilidade

source: Scale with web traffic
pt: Escalar com tráfego web

source: This application shares filesystem resources and can't be scaled.
pt: Esta aplicação compartilha recursos de sistema de arquivos e não pode ser escalada.

source: This application may require additional work to scale. Please see the application's documentation for more information.
pt: Esta aplicação pode requerer algum esforço adicional para escalar. Por favor consulte a documentação da aplicação para mais detalhes.

source: Required if a certificate chain or private key file is selected.
pt: Requerido se uma cadeia de certificados ou chave privada for selecionada.

source: Required if a certificate or certificate chain file is selected.
pt: Requerido se um certificado ou cadeia de certificados for selecionada.

source: Certificate private key file was empty.
pt: O arquivo da chave privada do certificado estava vazio.

source: SSL certificate chain file was empty.
pt: O arquivo da cadeia de certificados SSL estava vazio.

source: Namespace is required
pt: Namespace requerido

source: Can administer (+ team access)
pt: Pode administrar (+ acesso ao time)

source: Can administer
pt: Pode administrar

source: Can edit (+ team access)
pt: Pode editar (+ acesso ao time)

source: Can edit
pt: Pode editar

source: Can view (+ team access)
pt: Pode ver (+ acesso ao time)

source: Can view
pt: Pode ver

source: No role
pt: Sem papel

source: Team access only
pt: Somente acesso ao time

source: The %s members could not be updated.
pt: Os membros de %s não podem ser atualizados.

source: Remove from team
pt: Remover do time

source: Team member
pt: Membro do time

source: Personal Information
pt: Dados Pessoais

source: Your account does not allow custom SSL certificates.
pt: Sua conta não permite certificados SSL personalizados.

source: Custom SSL certificates are not allowed for this application.
pt: Certificados SSL personalizados não são permitidos para esta aplicação.

source: Aliases allow you to use your own domain names for your apps on OpenShift. To set up your own domain name for
pt: Aliases permitem que você use seus próprios domínios para seus aplicativos OpenShift. Para configurar seu próprio nome de domínio para

source: Set up the CNAME record with your DNS provider
pt: Configure o registro CNAME em seu provedor DNS

source: Tell us about your alias using the form on this page
pt: Informe-nos sobre seu alias usando o formulário nesta página

source: SSL Certificate
pt: Certificado SSL

source: Your plan doesn't allow custom SSL certificates.
pt: Seu plano não permite certificados SSL personalizados.

source: This alias already has a certificate. You can
pt: Este alias já possui um certificado. Você pode

source: or override it uploading a new one.
pt: ou substitui-lo usando um novo certificado.

source: If you delete this certificate, your users will not be able to browse your site securely.
pt: Se você deletar este certificado, seus usuários não poderão acessar seu site de forma segura.

source: Are you sure you wish to delete the certificate?
pt: Você tem certeza que deseja remover este certificado?

source: Upload an SSL certificate for your domain if you want your users to be able to browser your app securely. Accepted files are X509 certificates in .crt format.
pt: Envie um certificado SSL para seu domínio se quiser que seus usuários acessem sua aplicação de forma segura. Os arquivos aceitos são certificados X509 no formato .crt.

source: Certificate private key
pt: Chave privada do certificado

source: Private key required if adding a certificate.
pt: Chave privada requerida se estiver incluindo um certificado.

source: Certificate pass phrase
pt: Frase segura (senha) do certificado

source: Optional pass phrase for the certificate private key.
pt: Frase segura (senha) opcional para a chave privada do certificado.

source: Delete Alias from %s
pt: Deletar alias de %s

source: If you delete the alias <code>%s</code>, your app will not be accessible from this URL. Deleting this alias will also delete the certificate.
pt: Se você deletar o alias <code>%s</code>, sua aplicação não será mais acessível desta URL. Deletar este alias irá deletar também seu certificado.

source: Are you sure you wish to delete the alias?
pt: Você tem certeza que deseja remover este alias?

source: Alias '%s' from %s
pt: Alias '%s' de %s

source: The alias is
pt: O alias é

source: and the destination app is
pt: e o app destino é

source: Domain Name
pt: Nome do Domínio

source: If you need to change the domain name, please delete the alias and create a new one.
pt: Se você precisa alterar o nome do domínio, por favor delete o alias e crie um novo.

source: If you delete this alias, your app will not be accessible from this URL. Deleting this alias will also delete the certificate.
pt: Se você deletar este alias, sua aplicação não será mais acessível a partir desta URL. Deletar este alias também irá deletar o certificado.

source: Are you sure you wish to delete the alias
pt: Você tem certeza que deseja remover este alias

source: Date and time the existing certificate was added to this alias.
pt: Data e hora que este certificado foi incluído neste alias.

source: Your alias already has an SSL Certificate attached. Uploading a new certificate will override the existing one.
pt: Seu alias já possui um certificado SSL instalado. Enviar um novo certificado irá substituir o existente.

source: Optionally upload an SSL certificate for your custom domain alias to allow secure HTTPS communication with your app.
pt: Opcionalmente envie um certificado SSL para seu domínio customizado para habilitar comunicação segura via HTTPS com sua aplicação.

source: Certificate files must be Base64 PEM-encoded and typically have a .crt or .pem extension. You may combine multiple certificates and certificate chains in a single file, but the RSA or DSA private key must always be provided in a separate file.
pt: Arquivos de certificado devem ser codificados em Base64 PEM, tipicamente com uma extensão .crt ou .pem. Você pode combinar múltiplos certificados e cadeias de certificados em um único arquivo, mas a chave privada RSA ou DSA deve ser submetida em um arquivo separado.

source: SSL Certificate Chain
pt: Cadeia de certificados SSL

source: Optionally you can provide a certificate chain/bundle in a separate PEM-encoded file.
pt: Opcionalmente você pode fornecer uma cadeia de certificados (chain/bundle) em um arquivo codificado PEM separadamente.

source: Certificate Private Key
pt: Chave Privada do Certificado

source: RSA or DSA private key file for the root certificate in PEM-encoded format.
pt: Arquivo de chave privada RSA ou DSA para o certificado raiz, no formato PEM.

source: Private Key Pass Phrase
pt: Frase segura (senha) da chave privada

source: Pass phrase for the certificate private key, required if the provided private key is encrypted.
pt: Frase segura (senha) para a chave privada do certificado, requerido se a chave privada fornecida estiver criptografada.

source: Aliases for %s
pt: Aliases para %s

source: Aliases allow you to use your own domain names for your applications on OpenShift.
pt: Aliases permitem que você use seu próprio nome de domínio em sua aplicação OpenShift.

source: No aliases exist. %s
pt: Nenhum alias cadastrado. %s

source: Name
pt: Nome

source: edit
pt: editar

source: delete
pt: deletar

source: Note: In order to route traffic on your domain to OpenShift, you must %s.
pt: Nota: Para rotear tráfego para seu domínio no OpenShift, você deve %s.

source: New Alias for %s
pt: Novo Alias para %s

source: Aliases allow you to use your own domain names for your apps on OpenShift. To set up your own domain name for app
pt: Aliases permitem que você use seus próprios domínios para seus aplicativos OpenShift. Para configurar seu próprio nome de domínio para o app

source: Configure OpenShift to use your alias:
pt: Configure o OpenShift para usar seu alias:

source: Application URL
pt: URL da Aplicação

source: The current application URL. Set up a CNAME record with your DNS provider pointing to this URL.
pt: A URL atual da aplicação. Configure um registro CNAME em seu provedor de DNS apontando para esta URL.

source: Optionally you can provide a certificate chain in a separate PEM-encoded file.
pt: Opcionalmente você pode fornecer uma cadeia de certificados (chain/bundle) em um arquivo codificado PEM separadamente.

source: OpenShift maintained
pt: Mantido pelo OpenShift

source: Receives automatic security updates
pt: Recebe atualizações de segurança automáticas

source: Partner created
pt: Criado por parceiro

source: Created by a community member and not maintained by OpenShift
pt: Criado por uma comunidade de membros e não mantido pelo OpenShift

source: Community created
pt: Criado pela comunidade

source: When you create a QuickStart or a community cartridge, you are copying code from another repository. You are responsible for applying security fixes and updates.
pt: Quando você utiliza um QuickStart ou um cartucho de comunidade, está copiando código de outro repositório. Você é responsável por aplicar correções de segurança e atualizações.

source: Does not receive automatic security updates
pt: Não recebe atualizações de segurança automaticamente

source: This type is development only and will not be accessible in production
pt: Este tipo é apenas para desenvolvimento e não será acessível em produção

source: Gears are the application containers running your code.
pt: Gears são os containers de aplicação que rodam o seu código.

source: There are no gear sizes available for this application.
pt: Não existem gears disponíveis para esta aplicação.

source: If you require more resources, select a larger gear size here.
pt: Se você necessita de mais recursos, selecione um gear maior aqui.

source: Cartridges:
pt: Cartuchos:

source: none
pt: nada

source: This type is in development and will not be visible in production.
pt: Este tipo é apenas para desenvolvimento e não será acessível em produção.

source: Create a New Application
pt: Crie uma Nova Aplicação

source: Choose a web programming cartridge or kick the tires with a quickstart.
pt: Escolha um cartucho web para programar ou inicie com um quickstart.

source: After you create the application you can <strong>add cartridges to enable additional capabilities</strong> like databases, metrics, and continuous build support with Jenkins.
pt: Após criar a aplicação você pode <strong>adicionar cartuchos para habilitar funcionalidades</strong> como bases de dados, metricas e suporte a continuous build com Jenkins.

source: Search by keyword or tag
pt: Procure por palavra-chave ou tag

source: or
pt: ou

source: Browse by tag...
pt: Navegue por tag...

source: <b>Cartridge</b> &ndash; A managed runtime for your application.
pt: <b>Cartridge</b> &ndash; Um runtime básico para sua aplicação.

source: <b>QuickStart</b> &ndash; A quick way to try out a new technology with code and libraries preconfigured.
pt: <b>QuickStart</b> &ndash; Uma forma rápida de experimentar uma nova tecnologia com código e bibliotecas pré-configuradas.

source: You are responsible for updating core libraries for security updates.
pt: Você é responsável por atualizações de segurança.

source: Featured
pt: Em Destaque

source: There are no applications available to install
pt: Não existem aplicações disponíveis para instalar

source: Can't find what you're looking for? Try searching for a specific quickstart or filtering by tag.
pt: Não encontra o que busca? Experimente procurar por um quickstart específico ou filtrar por tag.

source: Or, browse the entire list in our %s.
pt: Ou, navegue pela lista completa em nossa %s.

source: QuickStart gallery
pt: galeria de Quickstarts

source: Code Anything
pt: Codifique Qualquer Coisa

source: Have your own framework? Provide the %s here, and OpenShift will download and provision it automatically into your new app!
pt: Possui seu próprio framework? Forneça a %s aqui, e o OpenShift vai baixar e provisionar automaticamente a informação da origem.

source: URL of a cartridge
pt: URL de um cartucho

source: URL to a cartridge definition
pt: URL para um cartucho

source: Base a new app on a cartridge you provide
pt: Baseie uma nova aplicação em um cartucho fornecido por você

source: Want to build your own cartridge? Get started with the DIY cart.
pt: Quer construir seu próprio cartucho? Inicie com o cartucho DIY.

source: After you create the application you can <strong>add cartridges to enable additional capabilities</strong> like databases, metrics, and continuous build support with Jenkins.
pt: Após criar a aplicação você pode <strong>adicionar cartuchos para habilitar funcionalidades</strong> como bases de dados, metricas e suporte a continuous build com Jenkins.

source: <b>QuickStart</b> &ndash; A quick way to try out a new technology with code and libraries preconfigured. You are responsible for updating core libraries for security updates.
pt: <b>QuickStart</b> &ndash; Uma forma rápida de experimentar uma nova tecnologia com código e bibliotecas pré-configuradas. Você é responsável por atualizações de segurança.

source: Can't find what you're looking for? Try broadening your search or filtering by another tag.
pt: Não encontra o que busca? Experimente ampliar a procura ou filtrar por outra tag.

source: Configure New Application
pt: Configurar Nova Aplicação

source: This template is development only and not accessible in production
pt: Este template é apenas para desenvolvimento e não será acessível em produção

source: Based On
pt: Baseado Em

source: This application is based on a URL.
pt: Esta aplicação é baseada em uma URL.

source: Public URL
pt: URL Pública

source: OpenShift will automatically register this domain name for your application.
pt: OpenShift vai registrar automaticamente este domínio para sua aplicação.

source: You can add your own domain name later.
pt: Você pode incluir seu domínio depois.

source: Source Code
pt: Código Fonte

source: Your application will start with an exact copy of the code and configuration provided in this Git repository.
pt: Sua aplicação vai iniciar com uma cópia exata de código e configuração fornecidos neste repositório Git.
