Repository: getupcloud/origin-server
Catalog: console/config/locales/*.po
Languages: pt

source: Before you can upload and download code, you need to upload a <strong>public key</strong> to identify you to our servers.
pt: Antes de publicar e baixar código, é necessário subir uma <strong>chave pública</strong> para identificar você em nossos servidores.

source: Each gear in your application will have a copy of your public key - this allows you to read and write to your Git repository as well as to access your application gears via SSH.
pt: Cada gear em sua aplicação terá um cópia da sua chave pública - isto permite que você leia e escreva em seu repositório Git, assim como acesse os gears de sua aplicação via SSH.

source: Add a public key
pt: Adicionar uma chave pública

source: Developers
pt: Desenvolvedores

source: User Guide
pt: Guia do Usuário

source: Ask on StackOverflow
pt: Pergunte no StackOverflow

source: Community
pt: Comunidade

source: Support
pt: Suporte

source: IRC Channel
pt: Canal IRC

source: Get the Source
pt: Código Fonte

source: Community Process
pt: Processo de Comunidade

source: Make it Better
pt: Ajude a Melhorar

source: OpenShift on GitHub
pt: OpenShift no GitHub

source: Source code for the OpenShift Origin management console is %s. %s for copyright and source information. OpenShift, OpenShift Origin and the OpenShift Logo are trademarks of Red Hat, Inc.
pt: O código fonte do console OpenShift Origin está %s. %s para informações de copyright e fonte. OpenShift, OpenShift Origin e o logotipo OpenShift são marcas registradas de Red Hat, Inc.

source: available on Github
pt: disponível no GitHub

source: Skip to main content
pt: Pular para o conteúdo principal

source: My Account (
pt: Minha Conta (

source: Logged in with:
pt: Logado como:

source: On:
pt: Em:

source: Once you remove yourself, you will not have access to this domain.
pt: Uma vez que remover-se, não terá mais acesso a este domínio.

source: Confirm leaving the domain
pt: Confirme a saida deste domínio

source: Once you remove yourself, you will not have access to this team.
pt: Uma vez que remover-se, não terá mais acesso a este time.

source: Confirm leaving the team
pt: Confirme a saida deste time

source: Owner
pt: Dono

source: Contains the team members
pt: Contém os membros do time

source: Contains no team members.
pt: Não contém membros de times.

source: What can members do?
pt: O que os membros podem fazer?

source: View
pt: Ver

source: &ndash; Read-only access to the domain and its applications.
pt: &ndash; Acesso somente-leitura ao domínio e suas aplicações.

source: Edit
pt: Editar

source: &ndash; Add, edit, control and delete applications in the domain, including SSH and Git access
pt: &ndash; Adicionar, editar controlar e deletar aplicações no domínio, incluindo acesso SSH e Git.

source: Administer
pt: Administrar

source: &ndash; Everything except change allowed gear sizes and the domain name.
pt: &ndash; Tudo, exceto mudar tamanhos de gears permitidos e o nome do domínio.

source: Leave Domain
pt: Sair do Domínio

source: Leave Team
pt: Sair

source: Depending on the size of your application it may take up to several minutes to restart.
pt: Dependendo do tamanho de sua aplicação, pode levar alguns minutos para reiniciar.

source: Confirm restart of application
pt: Confirme o reinício da aplicação

source: Restart Application
pt: Reiniciar aplicação

source: Disable Scaling for %s
pt: Desabilitar Escalabilidade de %s

source: Your application is currently set to scale the web cartridge.
pt: Sua aplicação está configurada para escalar o cartucho web.

source: At this time applications that scale cannot have scaling disabled.
pt: Atualmente não é possível desabilitar a escalabilidade em aplicações escaláveis.

source: You must create a new application and migrate your source code if you wish to remove the high availability proxy cartridge that provides scaling.
pt: Você deve criar uma nova aplicação e migrar seu código se quiser remover o cartucho do proxy de alta disponibilidade que permite escalar.

source: %s is not scalable
pt: %s não é escalável

source: This application is not currently scalable.
pt: Esta aplicação não é escalável.

source: For the time being applications must be set to scale when they are created.
pt: Por enquanto, aplicações devem ser configuradas como escalável no momento de sua criação.

source: To make a new application scalable you will need to pass the command line option <code>--scaling</code>:
pt: Para criar uma aplicação escalável você precisa passar a opções de linha de comando <code>--scaling</code>:

source: rhc create-app --scaling -a &lt;your application&gt; ...
pt: rhc create-app --scaling -a &lt;sua aplicação&gt; ...

source: or select "scaling" from the advanced options on the Create Application page.
pt: ou selecione "scaling" nas opções avançadas da página Criar Aplicação.

source: Scale %s
pt: Escalar %s

source: OpenShift monitors the incoming web traffic to your application and automatically adds or removes copies of your cartridge (each running on their own gears) to serve requests as needed.
pt: OpenShift monitora o tráfego web entrante em sua aplicação e automaticamente adiciona ou remove cópias de seu cartucho web (cada uma rodando em seu próprio gear) para servir requisições a medida do necessário.

source: Control the number of gears OpenShift will use for your cartridge:
pt: Controle o número de gear que o OpenShift irá usar para seu cartucho:

source: Minimum
pt: Mínimo

source: Maximum
pt: Máximo

source: Each scaled gear is created the same way - the normal post, pre, and deploy hooks are executed.
pt: Cada gear escalado é criado da mesma forma - os hooks de post, pre e deploy são executados normalmente.

source: Each cartridge will have its own copy of runtime data, so be sure to use a database if you need to share data across your web cartridges.
pt: Cada cartucho terá sua própria cópia dos dados de runtime, portanto certifique-se de usar um banco de dados para compartilhar dados entre gears de sua aplicação.

source: For status information about traffic to your application, see the HAProxy status page:
pt: Para informações sobre o tráfego para sua aplicação, veja a página de status do HAProxy:

source: This cartridge assists other cartridges in scaling, but does not itself scale.
pt: Este cartucho ajuda outros cartuchos na escalabilidade, mas não escala ele próprio.

source: This cartridge does not scale.
pt: Este cartucho não escala.

source: Your namespace is unique to your account and is the suffix of the public URLs we assign to your applications.
pt: Seu namespace é único para sua conta, usado como sufixo das URLs pública que atribuímos a suas aplicações.

source: Public Keys
pt: Chaves Públicas

source: OpenShift uses a public key to securely encrypt the connection between your local machine and your application and to authorize you to upload code.
pt: OpenShift usa uma chave pública para criptografar a conexão entre sua máquina local e sua aplicação, além de autorizar o upload do seu código.

source: You must create a private and public key on your local machine and then upload the public key before you can connect to your applications' Git repositories or remotely access your applications.
pt: Você deve criar uma chave privada e uma pública em sua máquina local, e então subir a chave pública antes de conectar no repositório Git ou acessar remotamente sua aplicação.

source: Authorizations
pt: Autorizações

source: Allow clients and 3rd parties to access your account via a secret token.
pt: Permite clientes e terceiros acessarem sua conta utilizando um token secreto.

source: Note
pt: Nota

source: Expires in
pt: Expira em

source: No other members
pt: Nenhum outro membro

source: Key name
pt: Nome da chave

source: Type
pt: Tipo

source: Contents
pt: Conteúdo

source: Teams
pt: Times

source: Organize users into teams to make domain member management easier.
pt: Organiza usuários em times para fazer o gerenciamento de membros de domínio mais facil.

source: Change Gear Storage for %s
pt: Mudar Storage do Gear %s

source: Gear storage space is used for code, logs, cache, config files, and databases.
pt: O espaço do storage do gear é usado para código, logs, cache, arquivos de configurações e bases de dados.

source: Gear storage is only accessible to the gear it's associated with, and isn't able to be shared between gears.
pt: O storage do gear só é acessível ao gear em que estiver associado, e não é possível compartilhar entre gears.

source: User files should be kept in shared storage.
pt: Arquivos de usuários devem ser mantidos em storage compartilhado.

source: If you are decreasing your storage, make sure to check your usage to ensure you will still have sufficient disk space.
pt: Se estiver diminuindo seu storage, certifique-se de checar o consumo antes para garantir que terá espaço suficiente.

source: Check Your Usage
pt: Checar Seu Consumo

source: You can check your usage with the RHC command line:
pt: Você pode verificar o consumo com o comando RHC:

source: This cartridge is scalable.
pt: Este cartucho é escalável.

source: The additional storage will apply to each extra gear.
pt: O storage adicional será aplicado para cada gear extra.

source: This storage will also be shared by:
pt: Este storage também será compartilhado com:

source: Additional Storage Per Gear
pt: Storage Adicional Por Gear

source: Delete Team
pt: Deletar Time

source: Are you sure you want to delete the team
pt: Você tem certeza que deseja remover o time

source: You are not a member of any teams
pt: Você não é membro de nenhum time

source: Teams you own
pt: Time pertencentes a você

source: Teams you are a member of
pt: Times que você é membro

source: Shared team
pt: Time compartilhados

source: Team&hellip;
pt: Time&hellip;

source: People who typically share the same role can be added to a team. The team can then be added as a member of a domain, and all of the people in the team will inherit the team's role on the domain.
pt: Pessoas que tipicamente desempenham o mesmo papel podem ser adicionadas ao mesmo time. O time pode então ser adicionado como membro de um domínio, e todas as pessoas do time irão herdar as permissões deste time no domínio.

source: If a person is a member of multiple teams which are members of a domain, or is also added as a domain member individually, their effective role is the higher of their individual role or their teams' roles on the domain.
pt: Se uma pessoa é membro de múltiplos times que são membros de um domínio, ou está inclusa como um membro individual do domínio, suas permissões efetivas são as mais altas dentre o conjunto de permissões dentro daquele domínio.

source: Create a Team
pt: Criar um Time

source: See the %s for information about adding a custom domain names to an application.
pt: Consulte o %s para informações sobre comos adicionar um domínio customizado em sua aplicação

source: See the %s for information about adding your own domain names to an application.
pt: Consulte o %s para informações sobre como adicionar seu próprio domínio customizado em sua aplicação

source: Learn more about SSH keys.
pt: Saiba mais sobre chaves SSH.

source: Cancel
pt: Cancelar

source: Delete
pt: Deletar

source: Add a new key...
pt: Adicionar chave...

source: Add authorization...
pt: Adicionar autorização...

source: Revoke all
pt: Revogar tudo

source: Are you sure you want to revoke all authorizations for this account? This will end any active sessions immediately.
pt: Você tem certeza que deseja revogar todas as autorizações desta conta? Isto irá terminar imediatamente qualquer sessão ativa.

source: Description of what this authorization is for
pt: Descreva para que serve esta autorização

source: Create another domain
pt: Criar outro domínio

source: See other domains
pt: Veja outros domínios

source: Add a user...
pt: Incluir um usuário...

source: Add members...
pt: Incluir membros...

source: Add a team...
pt: Incluir um time...

source: Edit members...
pt: Editar membros...

source: Save
pt: Salvar

source: Delete this domain...
pt: Deletar este domínio...

source: Domain
pt: Domínio

source: Domain %s
pt: Domínio %s

source: This domain is using %s and can use up to %s more
pt: Este domínio está usando %s e pode usar até %s mais

source: change
pt: alterar

source: Allow %s gears
pt: Permite gears %s

source: application
pt: aplicação

source: applications
pt: aplicações

source: A name for your key
pt: Um nome para sua chave

source: Paste the contents of your public key file
pt: Cole o conteúdo do seu arquivo da chave pública

source: Paste the contents of your public key file (.pub)
pt: Cole o conteúdo do seu arquivo da chave pública (.pub)

source: The contents of your public key file
pt: O conteúdo do arquivo da chave publica

source: Your SSH key will start with a short prefix that describes its type, followed by a long string of numbers and characters. Some keys have a bit of text at the end to describe who generated the key. Example: ssh-rsa AAAAB3NzaC1yc....HcLJ bob@smith
pt: Sua chave SSH deve iniciar com um pequeno prefixo que descreve seu tipo, seguido de uma sequência longa de números e letras. Algumas chaves possuem um pequeno texto no final que descreve quem gerou a chave. Exemplo: ssh-rsa AAAAB3NzaC1yc....HcLJ bob@smith

source: Are you sure you want to delete your key '%s'?
pt: Você tem certeza que deseja deletar a chave '%s'?

source: freenode.net on channel #openshift
pt: freenode.net no canal #openshift

source: file a bug
pt: reporte um bug

source: Search OpenShift and StackOverflow
pt: Busca OpenShift e StackOverflow

source: community forum
pt: forum da comunidade

source: Knowledge Base
pt: Base de Conhecimento

source: The Developer Center
pt: A Central do Desenvolvedor

source: see our Videos page
pt: veja nossa página de Videos

source: member
pt: membro

source: members
pt: membros

source: <p>OpenShift supports several database types out of the box (MySQL, PostgreSQL, and MongoDB).</p><p>Click on your application, and then at the bottom of the list of cartridges on the next page you'll see databases you can add.</p>
pt: <p>OpenShift suporte diversas bases de dados <em>out of the box</em> (MySQL, PostgreSQL, and MongoDB).</p><p>Clique em sua aplicação e então no final da lista de cartuchos na próxima página você verá as bases de dados que pode adicionar.</p>

source: Membership
pt: Membros

source: <p>You can give a collaborator access to your domains and applications. Adding someone as an editor on a domain gives them the ability to create or update your applications.</p><p>To add a collaborator, click on a domain name, and then in the Members section enter the login of another OpenShift member.</p>
pt: <p>Você pode dar a colaboradores acesso aos seus domínios e aplicações. Adicionar alguem como um editor em um domínio dá a eles a habilidade de criar ou atualizar suas aplicações.</p><p>Para adicionar um colaborador, clique em um domínio e então na seção Membros entre o login de outro membro OpenShift.</p>

source: <p>OpenShift gives you a public domain for each of your applications. If you have your own domain name, you can set it as an <strong>alias</strong> on your application.</p><p>Click on your application name to the left, and then select the 'change' link next to the application URL at the top of the overview page.</p>
pt: <p>OpenShift fornece um domínio público para cada aplicação sua. Se você possui seu próprio domínio, você pode incluí-lo como um <strong>alias</strong> em sua aplicação.</p><p>Clique no nome da sua aplicação a esquerda e então selecione o link 'mudar' próximo a URL da aplicação no topo da página de visão geral.

source: <p>Scalable applications can run multiple copies of your web code in parallel on different servers. This allows you to handle more web traffic, and to react to changing levels of demand.</p><p>To create a scalable app, choose an application type to create and change the 'Scaling' option on the 'Create Application' page.</p>
pt: <p>Aplicações escaláveis podem rodar múltiplas cópias do seu código web em paralelo, em diferentes servidores. Isto permite que atendam um maior tráfego web, e reajam a mudanças na demanda.</p><p>Para criar uma aplicação escalável, escolha um tipo de aplicação e mude a opção 'Escalabilidade' na página 'Criar Aplicação'.</p>

source: <p>From the command line, run <code>rhc tail &lt;app_name&gt;</code> to view your logs in realtime.</p>
pt: A partir da linha de comando, execute <code>rhc tail &lt;app_name&gt;</code> para ver seus logs em tempo real.</p>

source: <p>Each application can be backed up by using the snapshot command - run <code>rhc save-snapshot &lt;app_name&gt;</code> to download a tar file containing your code, databases, and other relevant data. Use <code>rhc restore-snapshot</code> to restore the state of an app.</p><p>Note that snapshot will stop your application as it runs.</p>
pt: <p>Cada aplicação pode ter um backup usando o comando snapshot - execute <code>rhc save-snapshot &lt;app_name&gt;</code> para baixar um arquivo tar contendo seu código, base de dados e outros dados relevantes. Use <code>rhc restore-snapshot</code> para restaurar o estado da aplicação.</p><p>Note que o snapshot irá parar a aplicação enquanto é executado.</p>

source: <p>From the command line, run <code>rhc port-forward</code> to access databases or internal ports directly.</p>
pt: <p>A artir da linha de comando, execute <code>rhc port-forward</code> para acessar a base de dados ou ports internas diretamente.</p>

source: Back
pt: Voltar

source: Create Application
pt: Criar Aplicação

source: Optional URL to a Git repository
pt: URL opcional de um repo Git

source: Want to log in to your application?
pt: Quer logar em sua aplicação?

source: Delete this application...
pt: Deletar esta aplicação...

source: The command below will open a Secure Shell (SSH) session to your application on most operating systems. See our %s for information about connecting with Windows, Mac, and Linux computers.
pt: O comando abaixo irá abrir uma sessão de Shell Seguro (SSH) com sua aplicação na maioria dos sistemas operacionais. Veja nossa %s para informações de conexão com Windows, Mac e Linux.

source: SSH help page
pt: página de ajuda SSH

source: Enable Jenkins
pt: Habilitar Jenkins

source: Enable Jenkins Builds
pt: Habilitar Builds Jenkins

source: Add %s
pt: Adicionar %s

source: Created %s ago in domain %s
pt: Criado %s atras no domínio %s

source: change alias
pt: alterar alias

source: For more information about scaling your applications see %s.
pt: Para mais informações sobre como escalar suas aplicações veja %s.

source: We hope to add the ability to enable scaling on existing applications in the future - you can provide feedback about this and other features in OpenShift via our %s.
pt: Esperamos adicionar a habilidade de escalar aplicações esxistentes no futuro - você pode fornece seu feedback sobre o assunto e outras solicitações de OpenShift via nossa %s.

source: feature request page
pt: página de sugestão de features

source: See all domains
pt: Ver todos os domínios

source: Each gear this cartridge is deployed to has %sGB of included storage.
pt: Cada gear em que este cartucho está instalado possui %sGB de storage.

source: For more information about storage for your application see %s.
pt: Para mais informações sobre storage para sua aplicação veja %s.

source: our FAQ on storage
pt: nosso FAQ sobre storage

source: After installing the RHC read more %s.
pt: Após instalar o RHC leia mais %s.

source: on how to manage your application from the command line in our User Guide
pt: sobre como gerenciar sua aplicação a partir da linha de comando em nosso Guia do Usuário

source: Links to download, install and use the JBoss Developer Studio for Linux, Mac OS X, or Windows can be found on the %s.
pt: Links para baixar, instalar e usar o JBoss Developer Studio para Linux, Mac OS X, ou Windows podem ser encontrados na %s.

source: JBoss Developer Studio tools page
pt: página JBoss Developer Studio tools

source: The server will run any of your configured %s and then restart the application.
pt: O servidor irá rodar seus %s configurados e então reiniciar a aplicação.

source: deploy hooks
pt: hooks de deploy

source: Follow these steps to install the client
pt: Siga estes passos para instalar o cliente

source: %s on Linux, Mac OS X, or Windows.
pt: %s no Linux, Mac OS X ou Windows.

source: OpenShift is configured to scale this cartridge with %s.
pt: OpenShift está configurado para escalar este cartucho com %s.

source: the web proxy HAProxy
pt: o proxy web HAProxy

source: For more information about scaling your application see %s.
pt: Para mais informações sobre escalar sua aplicação consulte %s.

source: our scaling guide in the Developer Center
pt: nosso guia de escalabilidade na Central do Desenvolvedor

source: New Alias
pt: Novo Alias

source: Enter your custom domain name. e.g. <em>www.example.com</em> or <em>something.example.com</em>
pt: Entre seu domínio customizado. Ex: <em>www.exemplo.com</em> ou <em>algo.exemplo.com</em>

source: %s gears
pt: gears %s

source: Minimum gears
pt: Minimo de gears

source: Maximum gears
pt: Maximo de gears

source: Team name
pt: Nome do time

source: Team %s
pt: Time %s

source: There are no other members in this %s. %s
pt: Não existem outros membros neste %s. %s

source: team
pt: time

source: Has access via these teams: %s
pt: Possui acesso via estes times: %s

source: View this team
pt: Ver este time

source: User Login
pt: Login do Usuário

source: Delete this team...
pt: Deletar este time...

source: other member
pt: outro membro

source: other members
pt: outros membros

source: Owned by %s
pt: Pertencente a %s

source: See other teams
pt: Ver outros times

source: Create a new team
pt: Crie um novo time

source: For applications in dev stage or the light ones (e.g. node.js), you can use the small gear. If you require more resources, select a larger gear size.
pt: Aplicações em DEV ou +leves como node.js por exemplo, o gear small pode ser suficiente. Se você precisa de mais recursos, selecione um gear maior.

source: In order to have access to more gear sizes, please %s.
pt: Para ter acesso a gears maiores, por favor %s.

source: validate your account
pt: valide sua conta

source: An namespace forms part of an application's URL and is unique to your account. The syntax for an application URL is <em>application–namespace.%s</em>.
pt: Um namespace forma parte da URL de uma aplicação e é exclusivo para sua conta. O formato para a URL de uma aplicação é <em>aplicação-namespace.#{@domain_suffix}</em>.

source: create a new namespace
pt: criar um novo namespace

source: downloadable cartridge
pt: cartucho baixavel

source: How to use my own domain?
pt: Como usar meu proprio dominio?

source: How to install rhc client tool for Windows?
pt: Como instalo o rhc client tools no Windows?

source: How to publish my site files? which tools shoud I use?
pt: Como publico os arquivos do meu site? Quais ferramentas devo usar?

source: Welcome to Getup Cloud
pt: Bem-vindo a Getup Cloud

source: Sign In
pt: Entrar

source: Password
pt: Senha

source: Forgot your password?
pt: Esqueçeu sua senha?

source: Idiom
pt: Idioma

source: Select console idiom
pt: Selectione o idioma do console

source: Change password of your Getup account
pt: Troque a senha de sua conta Getup

source: Change Password
pt: Trocar a Senha

source: To change your password, enter your old password and the new password in the fields below.
pt: Para trocar sua senha, informe a senha antiga e a nova nos campos abaixo.

source: Old Password
pt: Senha Antiga

source: New Password
pt: Nova Senha

source: New Password Again
pt: Repetir Nova Senha

source: Change
pt: Alterar

source: Contact Info
pt: Dados de Contato
